odip.opendatasupport.eu/value_mapping/es.org
#+TITLE: ODS Spain
#+OPTIONS: toc:2          (only to two levels in TOC)
#+TODO: TODO(t) WAIT(w@/!) | STARTED(s) | DONE(d!) CANCELED(c@)
#+DRAWERS: HIDDEN PROPERTIES STATE

