odip.opendatasupport.eu/value_mapping/es.org
* Introduction

   - http://192.168.33.33/lodms
   - http://192.168.33.33/sparql

To get the predicates accessible:

#+NAME: sparqlend_direct_predicates
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX orig: <http://data.gob.es/>
PREFIX dct: <http://purl.org/dc/terms/>
SELECT DISTINCT ?p
FROM <http://data.gob.es/>
where {
 ?ds a <http://www.w3.org/ns/dcat#Dataset> .
 ?ds ?p ?o
} ORDER BY ?p
#+end_src

#+RESULTS: sparqlend_direct_predicates
| p                                               |
| http://purl.org/dc/terms/accrualPeriodicity     |
| http://purl.org/dc/terms/conformsTo             |
| http://purl.org/dc/terms/description            |
| http://purl.org/dc/terms/identifier             |
| http://purl.org/dc/terms/issued                 |
| http://purl.org/dc/terms/language               |
| http://purl.org/dc/terms/license                |
| http://purl.org/dc/terms/modified               |
| http://purl.org/dc/terms/publisher              |
| http://purl.org/dc/terms/references             |
| http://purl.org/dc/terms/spatial                |
| http://purl.org/dc/terms/temporal               |
| http://purl.org/dc/terms/title                  |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| http://www.w3.org/ns/dcat#distribution          |
| http://www.w3.org/ns/dcat#keyword               |
| http://www.w3.org/ns/dcat#theme                 |

#+NAME: sparqlend_count
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gob.es/> 
SELECT DISTINCT ?dc ( COUNT(?ds) AS ?cnt )
FROM <http://data.gob.es/> 
WHERE {
 ?dc a dcat:Catalog .
 ?dc dcat:dataset ?ds .
} ORDER BY ?dc
#+end_src

#+RESULTS: sparqlend_count
| dc                                                       | cnt |
| http://s484195306.mialojamiento.es/datos/catalogo-prueba | 657 |

#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gob.es/> 
SELECT DISTINCT ?p
FROM <http://data.gob.es/> 
WHERE {
 ?dc a dcat:Distribution .
 ?dc ?p ?o .
}
#+end_src

#+RESULTS:
| p                                               |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| http://purl.org/dc/terms/format                 |
| http://purl.org/dc/terms/relation               |
| http://www.w3.org/ns/dcat#accessURL             |
| http://www.w3.org/ns/dcat#byteSize              |
| http://purl.org/dc/terms/title                  |

#+NAME: sparqlend_size
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT ?size ?title ?description
FROM <http://data.gob.es/> 
WHERE { 
  { select ( SUM(?len) AS ?size ) 
           { ?s ?p ?o .
             FILTER isLiteral(?o) 
             BIND(STRLEN(STR(?o)) AS ?len) }
  }
  { select ( SUM(?tlen) AS ?title ) 
           { ?s dct:title ?o .
             FILTER isLiteral(?o) 
             BIND(STRLEN(STR(?o)) AS ?tlen) }
  }
  { select ( SUM(?dlen) AS ?description ) 
           { ?s dct:description ?o .
             FILTER isLiteral(?o) 
             BIND(STRLEN(STR(?o)) AS ?dlen) }
  } 
}
#+end_src

#+RESULTS: sparqlend_size
|   size | title | description |
| 549888 | 47472 |      182953 |

#+NAME: sparqlend_key_value
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gob.es/> 
SELECT DISTINCT ?keyword
FROM <http://data.gob.es/> 
WHERE {
  ?ds a dcat:Dataset .
  ?ds dcat:keyword ?keyword . 
} ORDER BY ?keyword LIMIT 100
#+end_src

#+RESULTS: sparqlend_key_value
| keyword        |                 |                 |                 |              |         |
| Accesibilidad  |                 |                 |                 |              |         |
| ón             | del             | Estado          |                 |              |         |
| ón             | local           |                 |                 |              |         |
| ón             | periférica      |                 |                 |              |         |
| ón             | pública         |                 |                 |              |         |
| Agricultura    |                 |                 |                 |              |         |
| Agricultura.   | Transporte.     | Censos          | y               | directorios. |         |
| Agua           |                 |                 |                 |              |         |
| Anuncios       |                 |                 |                 |              |         |
| Archivos       |                 |                 |                 |              |         |
| ística.        | Catálogos       |                 |                 |              |         |
| ística.        | Censos          | y               | directorios     |              |         |
| Arte           |                 |                 |                 |              |         |
| ía             | Personal        |                 |                 |              |         |
| écnicas        |                 |                 |                 |              |         |
| Bibliotecas    |                 |                 |                 |              |         |
| álogos         |                 |                 |                 |              |         |
| ón             | ambiental       |                 |                 |              |         |
| ía             |                 |                 |                 |              |         |
| álogos         |                 |                 |                 |              |         |
| álogos.        |                 |                 |                 |              |         |
| Censos         | y               | directorios     |                 |              |         |
| Censos         | y               | directorios.    |                 |              |         |
| Centros        | sanitarios      |                 |                 |              |         |
| ía             |                 |                 |                 |              |         |
| Cine           |                 |                 |                 |              |         |
| Comercio       |                 |                 |                 |              |         |
| Comercio       | exterior        |                 |                 |              |         |
| Contrataciones | y               | licitaciones    |                 |              |         |
| ón             |                 |                 |                 |              |         |
| ísticos        |                 |                 |                 |              |         |
| ísticos.       |                 |                 |                 |              |         |
| Defensa        |                 |                 |                 |              |         |
| Dependencia    |                 |                 |                 |              |         |
| ámenes.        | Catálogos       |                 |                 |              |         |
| Discapacidad   |                 |                 |                 |              |         |
| Empresas       |                 |                 |                 |              |         |
| Encuestas      |                 |                 |                 |              |         |
| ísticas        |                 |                 |                 |              |         |
| ísticas        |                 |                 |                 |              |         |
| Exposiciones   |                 |                 |                 |              |         |
| ía             |                 |                 |                 |              |         |
| Fondos         | de              | pensiones       |                 |              |         |
| ón             | pública         |                 |                 |              |         |
| ía             |                 |                 |                 |              |         |
| Geociencias    |                 |                 |                 |              |         |
| ágenes         |                 |                 |                 |              |         |
| I+D            |                 |                 |                 |              |         |
| ón             | y               | exportación     |                 |              |         |
| ágenes.        |                 |                 |                 |              |         |
| Indicadores    |                 |                 |                 |              |         |
| Industria      |                 |                 |                 |              |         |
| Informes       |                 |                 |                 |              |         |
| Informes.      |                 |                 |                 |              |         |
| ón             |                 |                 |                 |              |         |
| ón             | de              | vehículos       |                 |              |         |
| Invalidez      |                 |                 |                 |              |         |
| Jurisprudencia |                 |                 |                 |              |         |
| álogos         |                 |                 |                 |              |         |
| Justicia       |                 |                 |                 |              |         |
| Lectura        |                 |                 |                 |              |         |
| ón             |                 |                 |                 |              |         |
| ón.            | Normas          | y               | jurisprudencia. |              |         |
| Mapas          | y               | planos          |                 |              |         |
| Medio          | Ambiente        |                 |                 |              |         |
| Medio          | rural           | y               | pesca           |              |         |
| ón             |                 |                 |                 |              |         |
| Museos         |                 |                 |                 |              |         |
| úsica          |                 |                 |                 |              |         |
| Normas         |                 |                 |                 |              |         |
| Normas         | y               | jurisprudencia  |                 |              |         |
| Normas         | y               | jurisprudencia. |                 |              |         |
| Normativa      | y               | jurisprudencia  |                 |              |         |
| Noticias       | y               | actualidad      |                 |              |         |
| Noticias       | y               | actualidad.     |                 |              |         |
| Oposiciones    | y               | procesos        | selectivos      |              |         |
| Patentes       |                 |                 |                 |              |         |
| Patrimonio     |                 |                 |                 |              |         |
| Pesca          |                 |                 |                 |              |         |
| ón             | y               | control         | de              | especies     | marinas |
| úblicas        |                 |                 |                 |              |         |
| úblicas        |                 |                 |                 |              |         |
| Procedimientos | administrativos |                 |                 |              |         |
| ícolas         | y               | ganaderas       |                 |              |         |
| Productos      | de              | Apoyo           |                 |              |         |
| Publicaciones  |                 |                 |                 |              |         |
| Publicaciones  | e               | informes        |                 |              |         |
| ón             | de              | mercados        | agrícolas       |              |         |
| Religiones     |                 |                 |                 |              |         |
| Sanidad        | vegetal         | y               | animal          |              |         |
| Sanidad.       | Censos          | y               | directorios     |              |         |
| Sector         | agroalimentario |                 |                 |              |         |
| Seguridad      | Social.         | Censos          | y               | directorios  |         |
| Seguros        |                 |                 |                 |              |         |
| Sociedad       | y               | bienestar       |                 |              |         |
| Sociedades     | mercantiles     |                 |                 |              |         |
| Sondeos        |                 |                 |                 |              |         |
| Subvenciones   | y               | ayudas          |                 |              |         |
| áfico          |                 |                 |                 |              |         |
| ículos         |                 |                 |                 |              |         |

#+NAME: sparqlend_theme
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gob.es/> 
SELECT DISTINCT ?theme
FROM <http://data.gob.es/> 
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?ds dcat:theme ?theme . 
} ORDER BY ?theme LIMIT 100
#+end_src

#+RESULTS: sparqlend_theme
| theme                                                              |
| http://datos.gob.es/kos/sector-publico/sector/ciencia-tecnologia   |
| http://datos.gob.es/kos/sector-publico/sector/comercio             |
| http://datos.gob.es/kos/sector-publico/sector/cultura-ocio         |
| http://datos.gob.es/kos/sector-publico/sector/economia             |
| http://datos.gob.es/kos/sector-publico/sector/educacion            |
| http://datos.gob.es/kos/sector-publico/sector/empleo               |
| http://datos.gob.es/kos/sector-publico/sector/hacienda             |
| http://datos.gob.es/kos/sector-publico/sector/legislacion-justicia |
| http://datos.gob.es/kos/sector-publico/sector/medio-ambiente       |
| http://datos.gob.es/kos/sector-publico/sector/medio-rural-pesca    |
| http://datos.gob.es/kos/sector-publico/sector/salud                |
| http://datos.gob.es/kos/sector-publico/sector/sector-publico       |
| http://datos.gob.es/kos/sector-publico/sector/seguridad            |
| http://datos.gob.es/kos/sector-publico/sector/sociedad-bienestar   |
| http://datos.gob.es/kos/sector-publico/sector/transporte           |

#+NAME: sparqlend_format
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gob.es/>
SELECT DISTINCT ?format
FROM <http://data.gob.es/>
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
  ?ds dct:format ?format . 
} ORDER BY ?format LIMIT 100
#+end_src

The list of acceptable file types can be accessed at:
     http://publications.europa.eu/resource/authority/file-type

#+NAME: sparqlend_select_concept
#+begin_src roqet :endpoint http://192.168.33.33/sparql
select distinct ?concept
FROM <http://publications.europa.eu/resource/authority/file-type>
WHERE {
  ?concept a <http://www.w3.org/2004/02/skos/core#Concept>
} ORDER BY ?concept
#+end_src

#+RESULTS: sparqlend_select_concept
: concept

