odip.opendatasupport.eu/mapping_queries/es.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ODS Spain</title>
<!-- 2013-12-19 Thu 16:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Massey" />
</head>
<body>
<div id="content">
<h1 class="title">ODS Spain</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Recommended</a>
<ul>
<li><a href="#sec-2-1">distribution title</a></li>
<li><a href="#sec-2-2">distribution description</a></li>
<li><a href="#sec-2-3">distribution format</a></li>
<li><a href="#sec-2-4">distribution accessURL</a></li>
<li><a href="#sec-2-5">distribution license</a></li>
</ul>
</li>
<li><a href="#sec-3">Optional</a>
<ul>
<li><a href="#sec-3-1">byte size</a></li>
<li><a href="#sec-3-2">download URL</a></li>
<li><a href="#sec-3-3">media type</a></li>
<li><a href="#sec-3-4">release dat</a></li>
<li><a href="#sec-3-5">modification date</a></li>
<li><a href="#sec-3-6">rights</a></li>
<li><a href="#sec-3-7">status</a></li>
<li><a href="#sec-3-8">title</a></li>
</ul>
</li>
<li><a href="#sec-4">Dataset properties</a>
<ul>
<li><a href="#sec-4-1">Mandatory</a></li>
<li><a href="#sec-4-2">Recommended</a></li>
<li><a href="#sec-4-3">Optional</a></li>
</ul>
</li>
<li><a href="#sec-5">Value Mapping</a></li>
<li><a href="#sec-6">ODS Spain Tasks</a>
<ul>
<li><a href="#sec-6-1">LodManager Initialisation <code>[2/3]</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://192.168.33.33/lodms">http://192.168.33.33/lodms</a>
</li>
<li><a href="http://192.168.33.33/sparql">http://192.168.33.33/sparql</a>
</li>
</ul>

<p>
To get the predicates accessible:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_direct_predicates">PREFIX orig: &lt;http://data.gob.es/&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt;
SELECT DISTINCT ?p
FROM &lt;http://data.gob.es/&gt;
where {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
 ?ds ?p ?o
} ORDER BY ?p
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">p</td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/accrualPeriodicity">http://purl.org/dc/terms/accrualPeriodicity</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/conformsTo">http://purl.org/dc/terms/conformsTo</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/description">http://purl.org/dc/terms/description</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/identifier">http://purl.org/dc/terms/identifier</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/issued">http://purl.org/dc/terms/issued</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/language">http://purl.org/dc/terms/language</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/license">http://purl.org/dc/terms/license</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/modified">http://purl.org/dc/terms/modified</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/publisher">http://purl.org/dc/terms/publisher</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/references">http://purl.org/dc/terms/references</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/spatial">http://purl.org/dc/terms/spatial</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/temporal">http://purl.org/dc/terms/temporal</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/title">http://purl.org/dc/terms/title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/1999/02/22-rdf-syntax-ns#type">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#distribution">http://www.w3.org/ns/dcat#distribution</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#keyword">http://www.w3.org/ns/dcat#keyword</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#theme">http://www.w3.org/ns/dcat#theme</a></td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_count">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gob.es/&gt; 
SELECT DISTINCT ?dc ( COUNT(?ds) AS ?cnt )
FROM &lt;http://data.gob.es/&gt; 
WHERE {
 ?dc a dcat:Catalog .
 ?dc dcat:dataset ?ds .
} ORDER BY ?dc
</pre>
</div>

<div class="org-src-container">

<pre class="src src-roqet">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gob.es/&gt; 
SELECT DISTINCT ?p
FROM &lt;http://data.gob.es/&gt; 
WHERE {
 ?dc a dcat:Distribution .
 ?dc ?p ?o .
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_size">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT ?size ?title ?description
FROM &lt;http://data.gob.es/&gt; 
WHERE { 
  { select ( SUM(?len) AS ?size ) 
	   { ?s ?p ?o .
	     FILTER isLiteral(?o) 
	     BIND(STRLEN(STR(?o)) AS ?len) }
  }
  { select ( SUM(?tlen) AS ?title ) 
	   { ?s dct:title ?o .
	     FILTER isLiteral(?o) 
	     BIND(STRLEN(STR(?o)) AS ?tlen) }
  }
  { select ( SUM(?dlen) AS ?description ) 
	   { ?s dct:description ?o .
	     FILTER isLiteral(?o) 
	     BIND(STRLEN(STR(?o)) AS ?dlen) }
  } 
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">size</td>
<td class="right">title</td>
<td class="right">description</td>
</tr>

<tr>
<td class="right">549888</td>
<td class="right">47472</td>
<td class="right">182953</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_key_value">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gob.es/&gt; 
SELECT DISTINCT ?keyword
FROM &lt;http://data.gob.es/&gt; 
WHERE {
  ?ds a dcat:Dataset .
  ?ds dcat:keyword ?keyword . 
} ORDER BY ?keyword LIMIT 100
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">keyword</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Accesibilidad</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">del</td>
<td class="left">Estado</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">local</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">periférica</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">pública</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Agricultura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Agricultura.</td>
<td class="left">Transporte.</td>
<td class="left">Censos</td>
<td class="left">y</td>
<td class="left">directorios.</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Agua</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Anuncios</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Archivos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ística.</td>
<td class="left">Catálogos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ística.</td>
<td class="left">Censos</td>
<td class="left">y</td>
<td class="left">directorios</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Arte</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ía</td>
<td class="left">Personal</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">écnicas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Bibliotecas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">álogos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">ambiental</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ía</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">álogos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">álogos.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Censos</td>
<td class="left">y</td>
<td class="left">directorios</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Censos</td>
<td class="left">y</td>
<td class="left">directorios.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Centros</td>
<td class="left">sanitarios</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ía</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Cine</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Comercio</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Comercio</td>
<td class="left">exterior</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Contrataciones</td>
<td class="left">y</td>
<td class="left">licitaciones</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ísticos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ísticos.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Defensa</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Dependencia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ámenes.</td>
<td class="left">Catálogos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Discapacidad</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Empresas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Encuestas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ísticas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ísticas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Exposiciones</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ía</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Fondos</td>
<td class="left">de</td>
<td class="left">pensiones</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">pública</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ía</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Geociencias</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ágenes</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">I+D</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">y</td>
<td class="left">exportación</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ágenes.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Indicadores</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Industria</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informes</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Informes.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">de</td>
<td class="left">vehículos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Invalidez</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Jurisprudencia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">álogos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Justicia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Lectura</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón.</td>
<td class="left">Normas</td>
<td class="left">y</td>
<td class="left">jurisprudencia.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Mapas</td>
<td class="left">y</td>
<td class="left">planos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Medio</td>
<td class="left">Ambiente</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Medio</td>
<td class="left">rural</td>
<td class="left">y</td>
<td class="left">pesca</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Museos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">úsica</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Normas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Normas</td>
<td class="left">y</td>
<td class="left">jurisprudencia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Normas</td>
<td class="left">y</td>
<td class="left">jurisprudencia.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Normativa</td>
<td class="left">y</td>
<td class="left">jurisprudencia</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Noticias</td>
<td class="left">y</td>
<td class="left">actualidad</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Noticias</td>
<td class="left">y</td>
<td class="left">actualidad.</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Oposiciones</td>
<td class="left">y</td>
<td class="left">procesos</td>
<td class="left">selectivos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Patentes</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Patrimonio</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Pesca</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">y</td>
<td class="left">control</td>
<td class="left">de</td>
<td class="left">especies</td>
<td class="left">marinas</td>
</tr>

<tr>
<td class="left">úblicas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">úblicas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Procedimientos</td>
<td class="left">administrativos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ícolas</td>
<td class="left">y</td>
<td class="left">ganaderas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Productos</td>
<td class="left">de</td>
<td class="left">Apoyo</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Publicaciones</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Publicaciones</td>
<td class="left">e</td>
<td class="left">informes</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ón</td>
<td class="left">de</td>
<td class="left">mercados</td>
<td class="left">agrícolas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Religiones</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sanidad</td>
<td class="left">vegetal</td>
<td class="left">y</td>
<td class="left">animal</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sanidad.</td>
<td class="left">Censos</td>
<td class="left">y</td>
<td class="left">directorios</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sector</td>
<td class="left">agroalimentario</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Seguridad</td>
<td class="left">Social.</td>
<td class="left">Censos</td>
<td class="left">y</td>
<td class="left">directorios</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Seguros</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sociedad</td>
<td class="left">y</td>
<td class="left">bienestar</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sociedades</td>
<td class="left">mercantiles</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Sondeos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Subvenciones</td>
<td class="left">y</td>
<td class="left">ayudas</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">áfico</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ículos</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_theme">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gob.es/&gt; 
SELECT DISTINCT ?theme
FROM &lt;http://data.gob.es/&gt; 
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?ds dcat:theme ?theme . 
} ORDER BY ?theme LIMIT 100
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">theme</td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/ciencia-tecnologia">http://datos.gob.es/kos/sector-publico/sector/ciencia-tecnologia</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/comercio">http://datos.gob.es/kos/sector-publico/sector/comercio</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/cultura-ocio">http://datos.gob.es/kos/sector-publico/sector/cultura-ocio</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/economia">http://datos.gob.es/kos/sector-publico/sector/economia</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/educacion">http://datos.gob.es/kos/sector-publico/sector/educacion</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/empleo">http://datos.gob.es/kos/sector-publico/sector/empleo</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/hacienda">http://datos.gob.es/kos/sector-publico/sector/hacienda</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/legislacion-justicia">http://datos.gob.es/kos/sector-publico/sector/legislacion-justicia</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/medio-ambiente">http://datos.gob.es/kos/sector-publico/sector/medio-ambiente</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/medio-rural-pesca">http://datos.gob.es/kos/sector-publico/sector/medio-rural-pesca</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/salud">http://datos.gob.es/kos/sector-publico/sector/salud</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/sector-publico">http://datos.gob.es/kos/sector-publico/sector/sector-publico</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/seguridad">http://datos.gob.es/kos/sector-publico/sector/seguridad</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/sociedad-bienestar">http://datos.gob.es/kos/sector-publico/sector/sociedad-bienestar</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/transporte">http://datos.gob.es/kos/sector-publico/sector/transporte</a></td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_format">PREFIX dct: &lt;http://purl.org/dc/terms/&gt;
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gob.es/&gt;
SELECT DISTINCT ?format
FROM &lt;http://data.gob.es/&gt;
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . 
  ?ds dct:format ?format . 
} ORDER BY ?format LIMIT 100
</pre>
</div>

<p>
The list of acceptable file types can be accessed at:
     <a href="http://publications.europa.eu/resource/authority/file-type">http://publications.europa.eu/resource/authority/file-type</a>
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_concept">select distinct ?concept
FROM &lt;http://publications.europa.eu/resource/authority/file-type&gt;
WHERE {
  ?concept a &lt;http://www.w3.org/2004/02/skos/core#Concept&gt;
} ORDER BY ?concept
</pre>
</div>
</div>
</div>
