odip.opendatasupport.eu/value_mapping/es.org
* Recommended
** distribution title

#+NAME: sparqlend_disttitle
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
SELECT DISTINCT ?disttitle 
FROM <http://data.gob.es/>
WHERE {
 ?ds a dcat:Distribution .
 ?ds dct:title ?disttitle . 
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_disttitle
| disttitle |
|      2008 |
|      2009 |
|      2010 |
|      2011 |
|      2012 |
|      2013 |
|        ía |
|        ón |
| Cantabria |
|        ón |

The INSERT statement is:

#+NAME: sparqlend_disttitle_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?distribution .
 ?distribution a dcat:Distribution .
 ?distribution dct:title ?title .
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds dcat:distribution ?dist.
 ?dist a dcat:Distribution .
 ?dist dct:title ?title .
 BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
 BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
#+end_src

** distribution description

#+NAME: sparqlend_distdescription
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?dist ?distdesc
WHERE {
 ?ds a dcat:Distribution . 
 ?ds dct:description ?distdesc .
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist)
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_distdescription
| resource | dist | distdesc |

The INSERT statement is:

#+NAME: sparqlend_distdescription_insert
#+BEGIN_SRC rq :tangle yes
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
PREFIX  orig: <http://data.gob.es/catalog/predicate/>
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:description ?description .
} WHERE { 
    ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
    ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
    ?ds dcat:distribution ?dist .
    ?dist a dcat:Distribution .
    ?dist dct:description ?description .
    BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
    BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
#+end_src

#+RESULTS: sparqlend_distdescription_insert

** distribution format

#+NAME: sparqlend_format
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?format
WHERE {
 ?ds a dcat:Distribution .
 ?ds dct:format ?format . 
 BIND(CONCAT(STR("XXXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist)
}
#+end_src

#+RESULTS: sparqlend_format

The INSERT statement is:

#+NAME: sparqlend_format_insert
#+BEGIN_SRC rq :tangle yes
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
PREFIX  orig: <http://data.gob.es/catalog/predicate/>
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:format ?format .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds dcat:distribution ?dist .
  ?dist a dcat:Distribution .
  ?dist dct:format ?format .
  BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
  BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
#+end_src

*** TODO mapping of the values (to a URI)
    

** distribution accessURL

#+NAME: sparqlend_accessURL
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gob.es/predicate/> 
SELECT DISTINCT ?distribution ?accessUrl
WHERE { GRAPH <http://data.gob.es/> {
 ?ds a dcat:Distribution .
 ?ds dcat:accessURL ?accessUrl .
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_accessURL
| distribution                                   | accessUrl                                                                                                |
| /distribution/7c11c57f170a0ca1d2c4a1fac7266b8a | http://www.catastro.minhap.es/esp/estadisticas_2.asp                                                     |
| /distribution/96aa6b6266b8f49a309fa773e3b4d1cf | http://www.alimentacion.es/imagenes/es/Plan_Consumo_Fruta_y_Verdura_en_Escuelas_2009_2010_tcm5-38690.pdf |
| /distribution/4826971ab145df7476f241c43326363e | https://sede.micinn.gob.es/inforct/                                                                      |
| /distribution/5acb5302deada315c25fab6f43b2bc8d | http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2008/index.htm                      |
| /distribution/c6514dcf7fcc0b059fbea1237175abac | http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2009/index.htm                      |
| /distribution/365365bf5761300eed9433f4c022eadb | http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2010/index.htm                      |
| /distribution/7a3b3b5b24247825ae68c3d3294e5536 | http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2011/index.htm                      |
| /distribution/e7b49bb25ecb17351ebd238f8e1c79c0 | http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2012/index.htm                      |
| /distribution/174b7e7dbf58af9c4f7fb8a38d2f417c | http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2013/index.htm                      |
| /distribution/4403d4a9974e87d7ccd82c7bed02ff94 | RevisionSelectionMethod=LatestReleased                                                                   |

The INSERT statement is:

#+NAME: sparqlend_accessURL_insert
#+BEGIN_SRC rq :tangle yes
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:accessURL ?accessUrl .
} WHERE {
    ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
    ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
    ?ds dcat:distribution ?dist .
    ?dist a dcat:Dataset .
    ?dist dcat:accessURL ?accessUrl .
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

*** TODO Check construction of ?distribution uri is okay.

