odip.opendatasupport.eu/mapping_queries/es.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Recommended</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> distribution title</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_disttitle">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gob.es/catalog/predicate/&gt; 
SELECT DISTINCT ?disttitle 
FROM &lt;http://data.gob.es/&gt;
WHERE {
 ?ds a dcat:Distribution .
 ?ds dct:title ?disttitle . 
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_disttitle_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?distribution .
 ?distribution a dcat:Distribution .
 ?distribution dct:title ?title .
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds dcat:distribution ?dist.
 ?dist a dcat:Distribution .
 ?dist dct:title ?title .
 BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
 BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> distribution description</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_distdescription">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?dist ?distdesc
WHERE {
 ?ds a dcat:Distribution . 
 ?ds dct:description ?distdesc .
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist)
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_distdescription_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
PREFIX  orig: &lt;http://data.gob.es/catalog/predicate/&gt;
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:description ?description .
} WHERE { 
    ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
    ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
    ?ds dcat:distribution ?dist .
    ?dist a dcat:Distribution .
    ?dist dct:description ?description .
    BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
    BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> distribution format</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_format">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?format
WHERE {
 ?ds a dcat:Distribution .
 ?ds dct:format ?format . 
 BIND(CONCAT(STR("XXXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist)
}
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_format_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
PREFIX  orig: &lt;http://data.gob.es/catalog/predicate/&gt;
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:format ?format .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds dcat:distribution ?dist .
  ?dist a dcat:Distribution .
  ?dist dct:format ?format .
  BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
  BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> mapping of the values (to a URI)</h4>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> distribution accessURL</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_accessURL">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gob.es/predicate/&gt; 
SELECT DISTINCT ?distribution ?accessUrl
WHERE { GRAPH &lt;http://data.gob.es/&gt; {
 ?ds a dcat:Distribution .
 ?ds dcat:accessURL ?accessUrl .
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">distribution</td>
<td class="left">accessUrl</td>
</tr>

<tr>
<td class="left">/distribution/7c11c57f170a0ca1d2c4a1fac7266b8a</td>
<td class="left"><a href="http://www.catastro.minhap.es/esp/estadisticas_2.asp">http://www.catastro.minhap.es/esp/estadisticas_2.asp</a></td>
</tr>

<tr>
<td class="left">/distribution/96aa6b6266b8f49a309fa773e3b4d1cf</td>
<td class="left"><a href="http://www.alimentacion.es/imagenes/es/Plan_Consumo_Fruta_y_Verdura_en_Escuelas_2009_2010_tcm5-38690.pdf">http://www.alimentacion.es/imagenes/es/Plan_Consumo_Fruta_y_Verdura_en_Escuelas_2009_2010_tcm5-38690.pdf</a></td>
</tr>

<tr>
<td class="left">/distribution/4826971ab145df7476f241c43326363e</td>
<td class="left"><a href="https://sede.micinn.gob.es/inforct/">https://sede.micinn.gob.es/inforct/</a></td>
</tr>

<tr>
<td class="left">/distribution/5acb5302deada315c25fab6f43b2bc8d</td>
<td class="left"><a href="http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2008/index.htm">http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2008/index.htm</a></td>
</tr>

<tr>
<td class="left">/distribution/c6514dcf7fcc0b059fbea1237175abac</td>
<td class="left"><a href="http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2009/index.htm">http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2009/index.htm</a></td>
</tr>

<tr>
<td class="left">/distribution/365365bf5761300eed9433f4c022eadb</td>
<td class="left"><a href="http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2010/index.htm">http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2010/index.htm</a></td>
</tr>

<tr>
<td class="left">/distribution/7a3b3b5b24247825ae68c3d3294e5536</td>
<td class="left"><a href="http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2011/index.htm">http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2011/index.htm</a></td>
</tr>

<tr>
<td class="left">/distribution/e7b49bb25ecb17351ebd238f8e1c79c0</td>
<td class="left"><a href="http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2012/index.htm">http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2012/index.htm</a></td>
</tr>

<tr>
<td class="left">/distribution/174b7e7dbf58af9c4f7fb8a38d2f417c</td>
<td class="left"><a href="http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2013/index.htm">http://www.dependencia.imserso.es/dependencia_01/estadisticas/inf_gp/2013/index.htm</a></td>
</tr>

<tr>
<td class="left">/distribution/4403d4a9974e87d7ccd82c7bed02ff94</td>
<td class="left">RevisionSelectionMethod=LatestReleased</td>
</tr>
</tbody>
</table>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_accessURL_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:accessURL ?accessUrl .
} WHERE {
    ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
    ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
    ?ds dcat:distribution ?dist .
    ?dist a dcat:Dataset .
    ?dist dcat:accessURL ?accessUrl .
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <span class="todo TODO">TODO</span> Check construction of ?distribution uri is okay.</h4>
</div>
</div>
