odip.opendatasupport.eu/value_mapping/es.org
** distribution license

The INSERT for the license is:

#+NAME: sparqlend_format_insert
#+BEGIN_SRC rq :tangle yes
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?distribution.
 ?distribution a dcat:Distribution.
 ?distribution dct:license ?license.
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Dataset .
 ?dist dct:license ?license . 
 BIND(concat(str(?harmds), "/distributions/") AS ?hds)
 BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

* Optional
** byte size

#+NAME: sparqlend_bytesize
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT DISTINCT ?distribution ?byteSize
WHERE { GRAPH <http://data.gob.es/> {
 ?ds a <http://www.w3.org/ns/dcat#Distribution>. 
 ?ds dcat:byteSize ?byteSize .
 FILTER( datatype(?byteSize) = xsd:decimal )
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_bytesize
| distribution | byteSize |

*** TODO byteSize is rdfs:Literal, but spec says xsd:decimal
  - Note :: The filter is *not* included in the lodms query at
            present - there would not be any results.

The INSERT statement is:

#+NAME: sparqlend_byteSize_insert
#+BEGIN_SRC rq :tangle yes
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:byteSize ?byteSize .
} WHERE {
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds dcat:distribution ?dist .
  ?dist a dcat:Distribution .
  ?dist dcat:byteSize ?byteSize .
  FILTER( datatype(?byteSize) = xsd:decimal )
  BIND(concat(str(?harmds), "/distributions/") AS ?hds)
  BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

** download URL

url points to a PDF

** media type

type indicates "dataset"

** release dat

The INSERT for the issued date.

#+NAME: sparqlend_rdate
#+BEGIN_SRC rq :tangle yes
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
prefix dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:issued ?created.
} WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?ds dcat:created ?created. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist)
}
#+end_src

** modification date

#+NAME: sparqlend_select_mdate
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
SELECT ?dist ?modified
WHERE {
 ?ds a dcat:Dataset . 
 ?ds dcat:revision_timestamp  ?modified .
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist) } LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_mdate

The INSERT is:

#+NAME: sparqlend_mdate
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
INSERT
{
 ?harmds dcat:distribution ?distribution .
 ?distribution a dcat:Distribution.
 ?distribution dct:modified ?modified.
}
WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution .
 ?dist dcat:byteSize ?byteSize .
 FILTER( datatype(?byteSize) = xsd:decimal )
 BIND(concat(str(?harmds), "/distributions/") AS ?hds)
 BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

** rights

** status

