odip.opendatasupport.eu/mapping_queries/es.html
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> distribution license</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The INSERT for the license is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_format_insert">PREFIX orig: &lt;http://data.gob.es/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?distribution.
 ?distribution a dcat:Distribution.
 ?distribution dct:license ?license.
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Dataset .
 ?dist dct:license ?license . 
 BIND(concat(str(?harmds), "/distributions/") AS ?hds)
 BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Optional</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> byte size</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_bytesize">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT DISTINCT ?distribution ?byteSize
WHERE { GRAPH &lt;http://data.gob.es/&gt; {
 ?ds a &lt;http://www.w3.org/ns/dcat#Distribution&gt;. 
 ?ds dcat:byteSize ?byteSize .
 FILTER( datatype(?byteSize) = xsd:decimal )
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">distribution</td>
<td class="left">byteSize</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> <span class="todo TODO">TODO</span> byteSize is rdfs:Literal, but spec says xsd:decimal</h4>
<div class="outline-text-4" id="text-3-1-1">
<dl class="org-dl">
<dt> Note </dt><dd>The filter is <b>not</b> included in the lodms query at
present - there would not be any results.
</dd>
</dl>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_byteSize_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:byteSize ?byteSize .
} WHERE {
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds dcat:distribution ?dist .
  ?dist a dcat:Distribution .
  ?dist dcat:byteSize ?byteSize .
  FILTER( datatype(?byteSize) = xsd:decimal )
  BIND(concat(str(?harmds), "/distributions/") AS ?hds)
  BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> download URL</h3>
<div class="outline-text-3" id="text-3-2">
<p>
url points to a PDF
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> media type</h3>
<div class="outline-text-3" id="text-3-3">
<p>
type indicates "dataset"
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> release dat</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The INSERT for the issued date.
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_rdate">PREFIX orig: &lt;http://data.gob.es/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
prefix dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:issued ?created.
} WHERE {
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?ds dcat:created ?created. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> modification date</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_mdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gob.es/catalog/predicate/&gt; 
SELECT ?dist ?modified
WHERE {
 ?ds a dcat:Dataset . 
 ?ds dcat:revision_timestamp  ?modified .
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist) } LIMIT 10
</pre>
</div>

<p>
The INSERT is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_mdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gob.es/catalog/predicate/&gt; 
INSERT
{
 ?harmds dcat:distribution ?distribution .
 ?distribution a dcat:Distribution.
 ?distribution dct:modified ?modified.
}
WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution .
 ?dist dcat:byteSize ?byteSize .
 FILTER( datatype(?byteSize) = xsd:decimal )
 BIND(concat(str(?harmds), "/distributions/") AS ?hds)
 BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
