odip.opendatasupport.eu/value_mapping/es.org
*** Mapping description

#+NAME: sparqlend_description_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
SELECT DISTINCT ?ds ?description
WHERE {
 ?ds a <http://www.w3.org/ns/dcat#Dataset> .
 ?ds dct:description ?description . 
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_description_select
| ds                                                                                                       | description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_annuario-statistico      | Pubblicazione che contiene in particolare serie storiche a livello nazionale e regionale riguardantiparco veicolare, prime iscrizioni, radiazioni, trasferimenti di proprieta di veicoli.La pubblicazione contiene altresi dati riguardanti spese ed oneri fiscali gravanti sull auto, elaboratidall Area Professionale Statistica dell ACI in base a fonti varie.Una sezione e dedicata a prezzi e consumi di carburanti per autotrazione, con dati di fonteMinistero delle attivita produttive e Staffetta petrolifera.La pubblicazione e edita entro il mese di luglio di ciascun anno con dati riferiti all anno precedente.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto             | Pubblicazione che contiene, suddivise in diverse sezioni, tutte le statistiche riguardanti il parcoveicolare al 31 dicembre dell anno di riferimento nonche i principali dati di flusso nel corsodell anno:Consistenza Parco veicoli: analisi statistica del parco veicolare al 31 dicembre secondo leprincipali caratteristiche del veicolo (unita statistica di rilevazione) - categoria, alimentazione,potenza, cilindrata, portata, posti, fabbrica, modello, classe euro -. I dati sono presentati a livellonazionale, di macroregione, regione, provincia, comune.Prime iscrizioni di veicoli: analisi statistica dei veicoli nuovi di fabbrica iscritti al PubblicoRegistro Automobilistico nel corso dell anno di riferimento. I principali caratteri di analisi sono:livello territoriale sulla base della residenza dell intestatario, categoria di veicolo, alimentazione,potenza, uso, fabbrica.Radiazioni di veicoli: analisi statistica dei veicoli radiati dal Pubblico RegistroAutomobilistico nel corso dell anno di riferimento. I principali caratteri di analisi sono: livelloterritoriale sulla base della residenza dell intestatario, categoria di veicolo, alimentazione, anno diimmatricolazione, classe Euro, mese, causale di radiazione.Trasferimenti di proprieta di veicoli: analisi statistica dei veicoli rivenduti nel corso dell annodi riferimento, sulla base delle risultanze del Pubblico Registro Automobilistico. I principali caratteridi analisi sono: categoria di veicolo, classe Euro, modello del veicolo.Metadati: La fonte primaria delle statistiche concernenti il parco veicolare e il Pra, Pubblicoregistro automobilistico, istituto gestito dall Aci e previsto dal Codice civile a tutela dei diritti deicittadini sugli autoveicoli. Tutte le statistiche sui veicoli confluiscono in due elaborazioni da archivioamministrativo facenti parte del Programma Statistico Nazionale - PSN -, ACI00002 ?Parcoveicolare? e ACI00014 ?Mercato automobilistico: prime iscrizioni, radiazioni,e trasferimenti diproprieta dei veicoli?.Periodicita: La pubblicazione e edita entro il mese di ottobre di ciascun anno con dati riferitiall anno precedente |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013        | Pubblicazione riguardante il mercato automobilistico con dati relativi a prime iscrizioni, trasferimenti di proprieta (mercato dell usato) totali ed al netto delle minivolture (veicoli presso i concessionari in attesa di essere rivenduti), radiazioni per categoria di veicoli. Dati a livello nazionale e provinciale, con calcolo di alcuni indicatori significativi La pubblicazione e edita mensilmente con dati relativi al mese precedente. Periodo Gennario-Giugno 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-2h-2013        | Pubblicazione riguardante il mercato automobilistico con dati relativi a prime iscrizioni, trasferimenti di proprieta (mercato dell usato) totali ed al netto delle minivolture (veicoli presso i concessionari in attesa di essere rivenduti), radiazioni per categoria di veicoli. Dati a livello nazionale e provinciale, con calcolo di alcuni indicatori significativi La pubblicazione e edita mensilmente con dati relativi al mese precedente. Periodo Luglio-Dicembre 2013                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_fringe-benefit           | Italia deve elaborare entro il 30 novembre di ciascun anno e comunicare al Ministero delle Finanze (ora Agenzia delle Entrate) che provvede alla pubblicazione entro il 31 dicembre, con effetto dal periodo di imposta successivo, al netto degli ammontari eventualmente trattenuti al dipendente.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_localizzazione-incidenti | La pubblicazione riporta il numero di incidenti stradali, morti e feriti nonche alcune caratteristichedegli incidenti - tipologia, presenza di veicoli pesanti o a due ruote, fascia oraria, luogo, mese - perciascun chilometro di strada o per tratte a livello provinciale o comunale. Sono disponibili alcuniindicatori.La ?rilevazione degli incidenti stradali con lesioni a persone? riguarda tutti gli incidentistradali verificatisi sulla rete stradale del territorio nazionale, verbalizzati da un autorita di Polizia odai Carabinieri, avvenuti su una strada aperta alla circolazione pubblica e che hanno causatolesioni a persone, morti e/o feriti, con il coinvolgimento di almeno un veicolo.L Aci cura in particolare le informazioni riguardanti la localizzazione e, in tempi piu recenti,l integrazione con i dati dei veicoli coinvolti desunti dal Pra. Le due elaborazioni rientrano nelProgramma Statistico Nazionale - PSN -, ACI00012 ?Localizzazione degli incidenti stradali? eACI00013 ?Veicoli e incidenti?.La pubblicazione e edita entro il mese di ottobre di ciascun anno con dati riferitiall anno precedente.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |
| http://data.opendatasupport.eu/id/catalog/it/dataset/autorita-di-bacino-del-fiume-arno_10                | Fasce altimetriche passo 100 metri, generate in automatico da DTM 100 metri.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |
| http://data.opendatasupport.eu/id/catalog/it/dataset/autorita-di-bacino-del-fiume-arno_1048              | Perimetrazione dei 17 acquiferi di pianura oggetto di bilancio. Tavole correlate (TAV A)Per dettagli vedere Relazione di Piano cap. Il quadro conoscitivo al paragrafo Caratterizzazione degli acquiferi significativi delle pianure alluvionali pag. 67 ; cap. Il bilancio delle acque sotterranee e la valutazione della disponibilit? idricaai paragrafi il bilancio degli acquiferi significativi pag.137 e Bilanci degli acquiferi significativi del bacino del fiume Arno pag. 144.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |
| http://data.opendatasupport.eu/id/catalog/it/dataset/autorita-di-bacino-del-fiume-arno_1049              | Perimetrazione aree di ricarica degli acquiferi oggetto di bilancio (Id=1048). Sono le aree di alimentazione delle falde degli acquiferi di pianura. Suddivise in due distinte tipologie, in funzione del loro tipo di permeabilit?:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |
| http://data.opendatasupport.eu/id/catalog/it/dataset/autorita-di-bacino-del-fiume-arno_1056              | Raggruppamento su base idrogeologica delle formazioni del bacino (complessi idrogeologici), che in funzione delle formazioni geologiche affioranti presentano simile assetto idrogeologico, produttivit?, vulnerabilit? e facies idrogeochimica.I complessi del bacino dell?Arno sono risultati i seguenti:                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:description ?description
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds a dcat:Dataset .
 ?ds dct:description ?description . 
}
#+END_SRC

