odip.opendatasupport.eu/value_mapping/es.org
*** Mapping Title
The INSERT statement is:
#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?ds a dcat:Dataset .
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds dct:title ?title .
}
#+END_SRC

** Recommended
*** Map tags to keywords

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
  ?harmds dcat:keyword ?keyword
} WHERE {
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?ds a dcat:Dataset . 
  ?ds dcat:keyword ?keyword .
}
#+END_SRC

*** Mapping theme

#+NAME: sparqlend_theme_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#> 
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?theme
FROM <http://data.gob.es/>
WHERE {
 ?ds a dcat:Dataset .
 ?ds dcat:theme ?theme .
} LIMIT 50
#+end_src

#+NAME: sparqlend_theme_select
| theme                                                              |
| http://datos.gob.es/kos/sector-publico/sector/hacienda             |
| http://datos.gob.es/kos/sector-publico/sector/sector-publico       |
| http://datos.gob.es/kos/sector-publico/sector/legislacion-justicia |
| http://datos.gob.es/kos/sector-publico/sector/seguridad            |
| http://datos.gob.es/kos/sector-publico/sector/cultura-ocio         |
| http://datos.gob.es/kos/sector-publico/sector/ciencia-tecnologia   |
| http://datos.gob.es/kos/sector-publico/sector/comercio             |
| http://datos.gob.es/kos/sector-publico/sector/transporte           |
| http://datos.gob.es/kos/sector-publico/sector/sociedad-bienestar   |
| http://datos.gob.es/kos/sector-publico/sector/empleo               |
| http://datos.gob.es/kos/sector-publico/sector/medio-rural-pesca    |
| http://datos.gob.es/kos/sector-publico/sector/medio-ambiente       |
| http://datos.gob.es/kos/sector-publico/sector/salud                |
| http://datos.gob.es/kos/sector-publico/sector/economia             |
| http://datos.gob.es/kos/sector-publico/sector/educacion            |

The INSERT Statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dcat:theme ?theme .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds a dcat:Dataset .
  ?ds dcat:theme ?theme . 
}
#+END_SRC

*** TODO Mapping contactPoint email

Not found 

*** TODO Mapping contactPoint name

Not found 

*** Mapping publisher

#+NAME: sparqlend_publisher_select
#+BEGIN_SRC roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
SELECT DISTINCT ?publisher
WHERE {
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_publisher_select
| publisher                                                          |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E04921301 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00003301 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E04921401 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00123904 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00003901 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00115003 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E04921801 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00131802 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00003801 |
| http://datos.gob.es/recurso/sector-publico/org/Organismo/E00130201 |

The INSERT statement is:

#+NAME: sparqlend_publisher_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:publisher ?publisher
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
}
#+END_SRC

** Optional

*** dataset conformsTo (dct:conformsTo)
    

#+NAME: sparqlend_conformsTo_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?ds ?conformsTo
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:conformsTo ?conformsTo .
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_conformsTo_select
| ds                 | conformsTo                                           |
| _:nodeIDzzzb192115 | http://www.boe.es/buscar/doc.php?id=BOE-A-2008-19826 |

The INSERT statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:conformsTo ?conforms .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:conformsTo ?conformsTo . 
}
#+END_SRC

*** TODO dataset frequency (dct:accrualPeriodicity)

Is present, but needs mapping

*** TODO dataset identifier (dct:identifier)

Not present.

*** TODO dataset landing page (dcat:landingPage)

Nothing found at present.

