odip.opendatasupport.eu/mapping_queries/es.html
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Mapping Title</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
The INSERT statement is:
</p>
<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?ds a dcat:Dataset .
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds dct:title ?title .
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Recommended</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Map tags to keywords</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
  ?harmds dcat:keyword ?keyword
} WHERE {
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?ds a dcat:Dataset . 
  ?ds dcat:keyword ?keyword .
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Mapping theme</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_theme_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt; 
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?theme
FROM &lt;http://data.gob.es/&gt;
WHERE {
 ?ds a dcat:Dataset .
 ?ds dcat:theme ?theme .
} LIMIT 50
</pre>
</div>

<table id="sparqlend_theme_select" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">theme</td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/hacienda">http://datos.gob.es/kos/sector-publico/sector/hacienda</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/sector-publico">http://datos.gob.es/kos/sector-publico/sector/sector-publico</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/legislacion-justicia">http://datos.gob.es/kos/sector-publico/sector/legislacion-justicia</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/seguridad">http://datos.gob.es/kos/sector-publico/sector/seguridad</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/cultura-ocio">http://datos.gob.es/kos/sector-publico/sector/cultura-ocio</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/ciencia-tecnologia">http://datos.gob.es/kos/sector-publico/sector/ciencia-tecnologia</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/comercio">http://datos.gob.es/kos/sector-publico/sector/comercio</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/transporte">http://datos.gob.es/kos/sector-publico/sector/transporte</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/sociedad-bienestar">http://datos.gob.es/kos/sector-publico/sector/sociedad-bienestar</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/empleo">http://datos.gob.es/kos/sector-publico/sector/empleo</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/medio-rural-pesca">http://datos.gob.es/kos/sector-publico/sector/medio-rural-pesca</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/medio-ambiente">http://datos.gob.es/kos/sector-publico/sector/medio-ambiente</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/salud">http://datos.gob.es/kos/sector-publico/sector/salud</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/economia">http://datos.gob.es/kos/sector-publico/sector/economia</a></td>
</tr>

<tr>
<td class="left"><a href="http://datos.gob.es/kos/sector-publico/sector/educacion">http://datos.gob.es/kos/sector-publico/sector/educacion</a></td>
</tr>
</tbody>
</table>

<p>
The INSERT Statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dcat:theme ?theme .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds a dcat:Dataset .
  ?ds dcat:theme ?theme . 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> <span class="todo TODO">TODO</span> Mapping contactPoint email</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Not found 
</p>
</div>
</div>
<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> <span class="todo TODO">TODO</span> Mapping contactPoint name</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Not found 
</p>
</div>
</div>
<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> Mapping publisher</h4>
<div class="outline-text-4" id="text-4-2-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_publisher_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?publisher
WHERE {
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_publisher_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:publisher ?publisher
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Optional</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> dataset conformsTo (dct:conformsTo)</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_conformsTo_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?ds ?conformsTo
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:conformsTo ?conformsTo .
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:conformsTo ?conforms .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:conformsTo ?conformsTo . 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> <span class="todo TODO">TODO</span> dataset frequency (dct:accrualPeriodicity)</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Is present, but needs mapping
</p>
</div>
</div>
<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> <span class="todo TODO">TODO</span> dataset identifier (dct:identifier)</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
Not present.
</p>
</div>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> <span class="todo TODO">TODO</span> dataset landing page (dcat:landingPage)</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
Nothing found at present.
</p>
</div>
</div>
