odip.opendatasupport.eu/value_mapping/es.org
*** dataset language (dct:language)

#+NAME: sparqlend_language_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?ds ?language
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:language ?language .
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_language_select
| ds                                                                                                                            | language                                                      |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/inspire-view-service-van-de-kabels-en-leidingen-van-de-gemeente-maasgouw | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/cbs-provincies-wms                                                       | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/zeegraskartering-wms                                                     | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/natuurbeheerplan-2014--collectief-beheerplan                             | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/geluid-bedrijventerreinen-1999--50db-contouren                           | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/bevolking-gemeente-ede-1647-1913                                         | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/ecotopen-wms                                                             | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/historische-geografie--jaagpaden-en-trekwegen                            | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/nationaal-archief-foto-s                                                 | http://publications.europa.eu/resource/authority/language/NLD |
| http://data.opendatasupport.eu/id/catalog/nl/dataset/natuurbeheerplan-2014--bijzonder-gebied                                  | http://publications.europa.eu/resource/authority/language/NLD |

The INSERT statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:language ?language .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:language ?language . 
}
#+END_SRC

**** TODO Language Value needs to be mapped (NLD)

*** dataset other identifier (adms:identifier)

Nothing relevant found?

*** dataset release date (dct:issued)

#+NAME: sparqlend_dsissued_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT ?ds ?issued
WHERE { GRAPH <http://data.gob.es/> {
 ?ds a dcat:Dataset . 
 ?ds dct:issued ?issued . 
 FILTER( datatype(?issued) = xsd:date )
} }  LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_dsissued_select
| ds                                                                                                                                           |     issued |
| http://s484195306.mialojamiento.es/datos/catalogo/estadisticas-catastro-inmobiliario-rustico                                                 | 2013-03-31 |
| http://s484195306.mialojamiento.es/datos/catalogo/estadisticas-catastro-inmobiliario-titulares                                               | 2013-03-31 |
| http://s484195306.mialojamiento.es/datos/catalogo/estadisticas-catastro-inmobiliario-urbano                                                  | 2013-03-31 |
| http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas                                  | 2003-01-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre | 2010-01-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo             | 2002-01-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/base-general-de-datos-de-entidades-locales                                                 | 2007-01-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes                                    | 2007-01-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales                         | 2007-01-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales                                                            | 2007-01-01 |

#+NAME: sparqlend_issued_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
INSERT {
  ?harmds dct:issued ?issued
} WHERE {
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?ds a dcat:Dataset . 
  ?ds dct:issued ?issued .
  FILTER( datatype(?issued) = xsd:date )
}
#+END_SRC

*** dataset modification date (dct:modified)

#+NAME: sparqlend_dsmodified_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT ?ds ?modified
WHERE { GRAPH <http://data.gob.es/> {
 ?ds a dcat:Dataset .
 ?ds dct:modified ?modified .
  FILTER( datatype(?modified) = xsd:date )
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_dsmodified_select
| ds                                                                                                                                           |   modified |
| http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas                                  | 2012-12-03 |
| http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre | 2013-04-17 |
| http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo             | 2013-03-27 |
| http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes                                    | 2012-12-30 |
| http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales                         | 2013-03-26 |
| http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales                                                            | 2013-04-30 |
| http://s484195306.mialojamiento.es/datos/catalogo/estadistica-sobre-gestion-ejecucion-de-fondos-de-compensacion-interterritorial             | 2013-04-01 |
| http://s484195306.mialojamiento.es/datos/catalogo/liquidacion-del-sistema-de-financiacion-de-comunidades-autonomas-ciudades-con-estatuto-de  | 2012-12-31 |
| _:nodeIDzzzb191349                                                                                                                           | 2013-08-05 |
| _:nodeIDzzzb191360                                                                                                                           | 2011-10-13 |

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
INSERT {
 ?harmds dct:modified ?modified
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds a dcat:Dataset . 
 ?ds dcat:modified ?modified . 
  FILTER( datatype(?modified) = xsd:date )
}
#+END_SRC

