odip.opendatasupport.eu/mapping_queries/es.html
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> dataset language (dct:language)</h4>
<div class="outline-text-4" id="text-4-3-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_language_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?ds ?language
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:language ?language .
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:language ?language .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:language ?language . 
}
</pre>
</div>
</div>

<ol class="org-ol"><li><span class="todo TODO">TODO</span> Language Value needs to be mapped (NLD)<br  /></li></ol>
</div>
<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> dataset other identifier (adms:identifier)</h4>
<div class="outline-text-4" id="text-4-3-6">
<p>
Nothing relevant found?
</p>
</div>
</div>
<div id="outline-container-sec-4-3-7" class="outline-4">
<h4 id="sec-4-3-7"><span class="section-number-4">4.3.7</span> dataset release date (dct:issued)</h4>
<div class="outline-text-4" id="text-4-3-7">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_dsissued_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT ?ds ?issued
WHERE { GRAPH &lt;http://data.gob.es/&gt; {
 ?ds a dcat:Dataset . 
 ?ds dct:issued ?issued . 
 FILTER( datatype(?issued) = xsd:date )
} }  LIMIT 10
</pre>
</div>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_issued_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
INSERT {
  ?harmds dct:issued ?issued
} WHERE {
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?ds a dcat:Dataset . 
  ?ds dct:issued ?issued .
  FILTER( datatype(?issued) = xsd:date )
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-8" class="outline-4">
<h4 id="sec-4-3-8"><span class="section-number-4">4.3.8</span> dataset modification date (dct:modified)</h4>
<div class="outline-text-4" id="text-4-3-8">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_dsmodified_select">PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT ?ds ?modified
WHERE { GRAPH &lt;http://data.gob.es/&gt; {
 ?ds a dcat:Dataset .
 ?ds dct:modified ?modified .
  FILTER( datatype(?modified) = xsd:date )
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="right">modified</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas">http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas</a></td>
<td class="right">2012-12-03</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre">http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre</a></td>
<td class="right">2013-04-17</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo">http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo</a></td>
<td class="right">2013-03-27</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes">http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes</a></td>
<td class="right">2012-12-30</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales">http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales</a></td>
<td class="right">2013-03-26</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales">http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales</a></td>
<td class="right">2013-04-30</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/estadistica-sobre-gestion-ejecucion-de-fondos-de-compensacion-interterritorial">http://s484195306.mialojamiento.es/datos/catalogo/estadistica-sobre-gestion-ejecucion-de-fondos-de-compensacion-interterritorial</a></td>
<td class="right">2013-04-01</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/liquidacion-del-sistema-de-financiacion-de-comunidades-autonomas-ciudades-con-estatuto-de">http://s484195306.mialojamiento.es/datos/catalogo/liquidacion-del-sistema-de-financiacion-de-comunidades-autonomas-ciudades-con-estatuto-de</a></td>
<td class="right">2012-12-31</td>
</tr>

<tr>
<td class="left">_:nodeIDzzzb191349</td>
<td class="right">2013-08-05</td>
</tr>

<tr>
<td class="left">_:nodeIDzzzb191360</td>
<td class="right">2011-10-13</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
INSERT {
 ?harmds dct:modified ?modified
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds a dcat:Dataset . 
 ?ds dcat:modified ?modified . 
  FILTER( datatype(?modified) = xsd:date )
}
</pre>
</div>
</div>
</div>
