odip.opendatasupport.eu/value_mapping/es.org
*** TODO dataset spatial/geographic (dct:spatial)

#+NAME: sparqlend_spatial_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?ds ?spatial
WHERE { GRAPH <http://data.gob.es/> {
 ?ds a dcat:Dataset .
 ?ds dct:spatial ?spatial .
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_spatial_select
| ds                                                                                                                                           | spatial |
| http://s484195306.mialojamiento.es/datos/catalogo/estadisticas-catastro-inmobiliario-titulares                                               | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas                                  | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo             | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/base-general-de-datos-de-entidades-locales                                                 | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes                                    | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales                         | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales                                                            | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-del-sector-publico-local                                               | ña      |
| http://s484195306.mialojamiento.es/datos/catalogo/estadistica-sobre-gestion-ejecucion-de-fondos-de-compensacion-interterritorial             | ña      |

The INSERT for the spatial is:

#+NAME: sparqlend_spatial_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:spatial ?modified
} WHERE {
 ?ds a dcat:Dataset . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?ds dct:spatial ?modified . 
}
#+END_SRC

*** TODO dataset temporal (dct:temporal)

Info not found

*** dataset version

#+NAME: sparqlend_version_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?version
WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds dcat:version  ?version . 
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_version_select
| version | ds |

#+NAME: sparqlend_version_insert
#+BEGIN_SRC rq :tangle yes
PREFIX orig: <http://data.gob.es/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#> 
INSERT { 
 ?harmds adms:version ?d .
} WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds  orig:version  ?d. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
}
#+END_SRC

*** TODO dataset version notes (adms:versionNotes)

Not found 

*** dataset status

Not found

