odip.opendatasupport.eu/mapping_queries/es.html
<div id="outline-container-sec-4-3-9" class="outline-4">
<h4 id="sec-4-3-9"><span class="section-number-4">4.3.9</span> <span class="todo TODO">TODO</span> dataset spatial/geographic (dct:spatial)</h4>
<div class="outline-text-4" id="text-4-3-9">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_spatial_select">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
SELECT ?ds ?spatial
WHERE { GRAPH &lt;http://data.gob.es/&gt; {
 ?ds a dcat:Dataset .
 ?ds dct:spatial ?spatial .
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">spatial</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/estadisticas-catastro-inmobiliario-titulares">http://s484195306.mialojamiento.es/datos/catalogo/estadisticas-catastro-inmobiliario-titulares</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas">http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-dependientes-de-comunidades-autonomas</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre">http://s484195306.mialojamiento.es/datos/catalogo/ejecucion-presupuestaria-mensual-de-comunidades-autonomas-datos-de-ejecucion-informe-sobre</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo">http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-de-comunidades-ciudades-autonomas-base-de-datos-resumen-ejecutivo</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/base-general-de-datos-de-entidades-locales">http://s484195306.mialojamiento.es/datos/catalogo/base-general-de-datos-de-entidades-locales</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes">http://s484195306.mialojamiento.es/datos/catalogo/imposicion-local-tipos-de-gravamen-indices-coeficientes</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales">http://s484195306.mialojamiento.es/datos/catalogo/presupuestos-liquidaciones-de-entidades-locales-datos-individuales</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales">http://s484195306.mialojamiento.es/datos/catalogo/deuda-viva-de-entidades-locales</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-del-sector-publico-local">http://s484195306.mialojamiento.es/datos/catalogo/inventario-de-entes-del-sector-publico-local</a></td>
<td class="left">ña</td>
</tr>

<tr>
<td class="left"><a href="http://s484195306.mialojamiento.es/datos/catalogo/estadistica-sobre-gestion-ejecucion-de-fondos-de-compensacion-interterritorial">http://s484195306.mialojamiento.es/datos/catalogo/estadistica-sobre-gestion-ejecucion-de-fondos-de-compensacion-interterritorial</a></td>
<td class="left">ña</td>
</tr>
</tbody>
</table>

<p>
The INSERT for the spatial is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_spatial_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:spatial ?modified
} WHERE {
 ?ds a dcat:Dataset . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?ds dct:spatial ?modified . 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-10" class="outline-4">
<h4 id="sec-4-3-10"><span class="section-number-4">4.3.10</span> <span class="todo TODO">TODO</span> dataset temporal (dct:temporal)</h4>
<div class="outline-text-4" id="text-4-3-10">
<p>
Info not found
</p>
</div>
</div>
<div id="outline-container-sec-4-3-11" class="outline-4">
<h4 id="sec-4-3-11"><span class="section-number-4">4.3.11</span> dataset version</h4>
<div class="outline-text-4" id="text-4-3-11">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_version_select">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
SELECT ?version
WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds dcat:version  ?version . 
} LIMIT 10
</pre>
</div>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_version_insert">PREFIX orig: &lt;http://data.gob.es/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
INSERT { 
 ?harmds adms:version ?d .
} WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds  orig:version  ?d. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-12" class="outline-4">
<h4 id="sec-4-3-12"><span class="section-number-4">4.3.12</span> <span class="todo TODO">TODO</span> dataset version notes (adms:versionNotes)</h4>
<div class="outline-text-4" id="text-4-3-12">
<p>
Not found 
</p>
</div>
</div>
