odip.opendatasupport.eu/mapping_queries/es.html
<div id="outline-container-sec-4-3-13" class="outline-4">
<h4 id="sec-4-3-13"><span class="section-number-4">4.3.13</span> dataset status</h4>
<div class="outline-text-4" id="text-4-3-13">
<p>
Not found
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Value Mapping</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="http://publications.europa.eu/resource/authority/file-type">http://publications.europa.eu/resource/authority/file-type</a>
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_concept">select distinct ?concept
FROM &lt;http://publications.europa.eu/resource/authority/file-type&gt;
WHERE {
  ?concept a &lt;http://www.w3.org/2004/02/skos/core#Concept&gt;
} ORDER BY ?concept
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">concept</th>
<th scope="col" class="left">current</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/AZW">http://publications.europa.eu/resource/authority/file-type/AZW</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/CSV">http://publications.europa.eu/resource/authority/file-type/CSV</a></td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/DBF">http://publications.europa.eu/resource/authority/file-type/DBF</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/DOC">http://publications.europa.eu/resource/authority/file-type/DOC</a></td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/DOCX">http://publications.europa.eu/resource/authority/file-type/DOCX</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/E00">http://publications.europa.eu/resource/authority/file-type/E00</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/EPUB">http://publications.europa.eu/resource/authority/file-type/EPUB</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/FMX2">http://publications.europa.eu/resource/authority/file-type/FMX2</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/FMX3">http://publications.europa.eu/resource/authority/file-type/FMX3</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/FMX4">http://publications.europa.eu/resource/authority/file-type/FMX4</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/GIF">http://publications.europa.eu/resource/authority/file-type/GIF</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/GZIP">http://publications.europa.eu/resource/authority/file-type/GZIP</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/HTML">http://publications.europa.eu/resource/authority/file-type/HTML</a></td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/JPEG">http://publications.europa.eu/resource/authority/file-type/JPEG</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/JSON">http://publications.europa.eu/resource/authority/file-type/JSON</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/KML">http://publications.europa.eu/resource/authority/file-type/KML</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/MDB">http://publications.europa.eu/resource/authority/file-type/MDB</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/MOBI">http://publications.europa.eu/resource/authority/file-type/MOBI</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/MOP">http://publications.europa.eu/resource/authority/file-type/MOP</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/MXD">http://publications.europa.eu/resource/authority/file-type/MXD</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/OP_DATPRO">http://publications.europa.eu/resource/authority/file-type/OP_DATPRO</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PDF">http://publications.europa.eu/resource/authority/file-type/PDF</a></td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PDFA1A">http://publications.europa.eu/resource/authority/file-type/PDFA1A</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PDFA1B">http://publications.europa.eu/resource/authority/file-type/PDFA1B</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PDFX">http://publications.europa.eu/resource/authority/file-type/PDFX</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PNG">http://publications.europa.eu/resource/authority/file-type/PNG</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PPSX">http://publications.europa.eu/resource/authority/file-type/PPSX</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PPT">http://publications.europa.eu/resource/authority/file-type/PPT</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/PPTX">http://publications.europa.eu/resource/authority/file-type/PPTX</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/RDF_XML">http://publications.europa.eu/resource/authority/file-type/RDF_XML</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/RTF">http://publications.europa.eu/resource/authority/file-type/RTF</a></td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/SGML">http://publications.europa.eu/resource/authority/file-type/SGML</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/SKOS_XML">http://publications.europa.eu/resource/authority/file-type/SKOS_XML</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/SPARQLQ">http://publications.europa.eu/resource/authority/file-type/SPARQLQ</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/SPARQLQRES">http://publications.europa.eu/resource/authority/file-type/SPARQLQRES</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/TIFF">http://publications.europa.eu/resource/authority/file-type/TIFF</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/TSV">http://publications.europa.eu/resource/authority/file-type/TSV</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/TXT">http://publications.europa.eu/resource/authority/file-type/TXT</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/XHTML">http://publications.europa.eu/resource/authority/file-type/XHTML</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/XLS">http://publications.europa.eu/resource/authority/file-type/XLS</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/XLSX">http://publications.europa.eu/resource/authority/file-type/XLSX</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/XML">http://publications.europa.eu/resource/authority/file-type/XML</a></td>
<td class="left">yes</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/XSLT">http://publications.europa.eu/resource/authority/file-type/XSLT</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><a href="http://publications.europa.eu/resource/authority/file-type/ZIP">http://publications.europa.eu/resource/authority/file-type/ZIP</a></td>
<td class="left">yes</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-5-0-1" class="outline-4">
<h4 id="sec-5-0-1"><span class="section-number-4">5.0.1</span> <span class="todo TODO">TODO</span> Mapping of the format, finish the rest - possible to just copy</h4>
<div class="outline-text-4" id="text-5-0-1">
<p>
across and instantiate it?
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> ODS Spain Tasks</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> LodManager Initialisation <code>[2/3]</code></h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> <span class="done DONE">DONE</span> Virtuoso Extractors</h4>
<div class="outline-text-4" id="text-6-1-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-16 Mon 15:41]</span></span>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> <span class="todo TODO">TODO</span> Transformers <code>[5/6]</code></h4>
