odip.opendatasupport.eu/value_mapping/es.org
**** DONE ODS Dcat application profile harmonizer
     - State "DONE"       from "TODO"       [2013-12-16 Mon 16:53]
 - set to 'es'
**** DONE ODS Modification Detector
     - State "DONE"       from "TODO"       [2013-12-16 Mon 16:54]
 - nothing to configure?
**** Sparql Update Tranformations [1/2]
***** DONE Initial versions
      - State "DONE"       from "TODO"       [2013-12-18 Wed 09:24]
***** TODO Test Transformations
**** ODS Value Mapper [1/2]
***** DONE Plugin Added
      - State "DONE"       from ""           [2013-12-18 Wed 09:22]
***** TODO Add Value Mappings
**** DONE ODS Cleaner
     - State "DONE"       from "TODO"       [2013-12-16 Mon 16:54]
**** DONE ODS Validator 
     - State "DONE"       from "TODO"       [2013-12-16 Mon 16:54]
*** DONE Virtuoso Loader
    - State "DONE"       from "TODO"       [2013-12-17 Tue 11:41]

*** Tests

#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?s ?p ?o
FROM <http://data.gob.es/>
WHERE {
  ?s a dcat:Distribution.
  OPTIONAL {?s dcterms:format ?format }
  FILTER (!BOUND(?format))
  BIND("p" AS ?p)
  BIND("o" AS ?o)
} LIMIT 10
#+end_src

#+RESULTS:
| s | p | o |

